<html>

<head>
<link rel="stylesheet" type="text/css" href=":/help/about.css" />
<link rel="stylesheet" type="text/css" href="../about.css" />
<meta content="es" name="language" />
<meta content="es" http-equiv="Content-Language" />
<meta name="viewport" content="user-scalable=no, width=device-width" />

<title>Manual de ChessX</title>

<body>

<div id="container">
<div id="header">

<h1>Ayuda de ChessX</h1>

<div id="nav">
<ul>

<li><a href="about0.html">Informaci&oacute;n b&aacute;sica</a></li>
<li><a href="about1.html">Manual</a></li>
<li><b>Personalizando ChessX</b></li>
<li><a href="about2.html">Referencia</a></li>
<li><a href="about3.html">Derechos de autor</a></li>

</ul>
</div>
</div>

<div id="content">
<h2><a name="Handbuch">Personalizando ChessX</a></h2>

<h3><a name="ChessX on a stick"></a>Experimentando con las opciones de ChessX</h3>
<p> Es posible salvar una copia de sus preferencias en el directorio de la
  aplicaci&oacute;n (opuesto a el directorio del sistema para los archivos
  ini). desde el panel App del di&aacute;logo de preferencias. Durante el reinicio,
  ChessX b&uacute;sca el directorio de la aplicaci&oacute;n por un archivo ini y &uacute;tiliza
  &eacute;se, si en encontrado, en vez de &eacute;l que es guardado en la localizaci&oacute;n de &eacute;l
  sistema. &Eacute;sto es conveniente cuando se &eacute;sta experimentado con las opciones
  de ChessX

<p> De &eacute;sta manera es posible simplemente instalar ChessX en una computadora,
  y transladar todos los ajustes, por ejemplo usando una memoria USB.</p>

<p>Sin embargo, las bases de datos tendr&aacute;n que ser copiadas separadamente, y
  las rutas de accesso necesitar&aacute;n ser ajustadas (a no ser que est&eacute;n
  localizadas en el mismo lugar en todos los computadores).</p>

<h3><a name="Custom-Arrange"></a>Rearreglando la aplicacion</h3>

<p>
  La ventana de ChessX es muy flexible; todas las listas y submen&uacute;s pueden
  ser ubicados en cualquier localizaci&oacute;n, o agrupados juntos en una vista
  tabulada.</p>

<p>Si un submen&uacute; es escondido, puede ser presentado nuevamente al
  seleccionarlo en el men&uacute; Vistas de la barra de men&uacute;s.</p>

<h3><a name="Custom-Lists"></a>Personalizacion de vistas en lista</h3>

<p> El tipo y tama&ntilde;o de la fuente de todas las listas puede ser modificado
  desde el di&aacute;logo de preferencias. En adici&oacute;n, todos los encabezados de las
  listas soportan tama&ntilde;o ajustable, relocalizaci&oacute;n, y escondido de
  columnas. Las columnas pueden ser mostradas &uacute; ocultadas con click derecho en
  el encabezado. Todos los cambios son persistentes.</p>

<h3><a name="Custom-Gamelist"></a>Personalizacion de la lista de juegos</h3>

<p>La lista de juegos, por defecto, muestra las et&iacute;quetas mas comunes de PGN
  en forma de columna. &Uacute;sted puede a&ntilde;adir columnas colocando et&iacute;quetas PGN
  en el di&aacute;logo de Preferencias / Apariencia / et&iacute;quetas PGN adicionales,
  por ejemplo,  "Ajustes FEN" a&ntilde;adir&aacute; dos columnas con las et&iacute;quetas Ajustes y FEN respect&iacute;vamente.</p>

<p>Hay una et&iacute;queta especial llamada "Medalla". Si a &eacute;sta et&iacute;queta se le d&aacute; el
  nombre de un color, la entrada de lista de juegos usar&aacute; este color de fondo.</p>

<h3><a name="Custom-Board"></a>Personalizacion de tablero y notacion</h3>

<p>El tablero y la notaci&oacute;n se personalizan f&aacute;cilmente desde el di&aacute;logo de
  preferencias. Especialmente la notaci&oacute;n puede ser cambiada para reflejar el
  lenguaje local. Por ejemplo, en Espa&ntilde;ol, la Dama es representada por el
  grafema "D", en vez de la "Q" que representa a el est&aacute;ndar, de el Ingl&eacute;s
  "Queen", simplemente cambiando las letras de las piezas en la pesta&ntilde;a
  Apariencias. La notaci&oacute;n tambi&eacute;n puede cambiarse para ser representanda por 
  el s&iacute;mbolo de las piezas, en vez de el car&aacute;cter alfan&uacute;merico
  correspondiente. Es de notar que el archivo PGN permanece con la notaci&oacute;n
  est&aacute;ndar, en Ingl&eacute;s KQRBN.</p>
<!--Note: I tested in Linux, and symbolic representation also works in that OS-->

<h3><a name="Custom-KB"></a>Personalizacion de atajos de teclado</h3>

<p>Los atajos de teclado se personalizand desde el correspondiente di&aacute;logo
  desde el men&uacute; de Ayuda.   Es recomendado ser cuidadoso, ya que no hay una
  implementaci&oacute;n de   verificaci&oacute;n de errores de s&iacute;ntaxis o de entradas
  inv&aacute;lidas, a&uacute;n.</p> 

<p> Es de notar que la personalizaci&oacute;n esta asociada con la selecci&oacute;n de
  lenguaje, por lo tanto es posible tener un esquema de teclado diferente con
  diferentes idiomas.</p>
 
<h3><a name="Custom-Icons"></a>Personalizacion de los iconos del menu</h3>

<p> Los &iacute;conos en el men&uacute; pueden ser habilitados o deshabilitados desde el
  di&aacute;logo de preferencias. Mostrar &iacute;conos en el men&uacute; puede ayudarle
  inicialmente mientras se familiariza con ChessX, pero es probable que luego,
  no desee tener &iacute;conos asociados a entradas de men&uacute;. </p>

<h3><a name="Themes"></a>Temas e idiomas</h3>

<p>ChessX incorpora un modo &oacute;scuro que puede ser activado a travez de &eacute;l men&uacute;
  Preferencias / Apariencia. Es posible hacer que el tema &oacute;scuro aparezca
  mejor integrado al cambiar en Preferencias / Juego / Colores / L&iacute;nea
  principal, a Blanco. El di&aacute;logo de preferencias presenta una lista de temas
  disponibles, la mayor&iacute;a de los cuales funcionan en modo &oacute;scuro y claro. </p>

<p>Espec&iacute;ficamenete en OS X: Si ChessX es iniciado en un escritorio a modo
  &oacute;scuro, ChessX autom&aacute;ticamente cambiar&aacute; a modo &oacute;scuro, tambi&eacute;n, para una
  mejor integraci&oacute;n.</p>

<p>Para cambiar el tema activo, o seleccionar un nuevo lenguaje, es necesario
  reiniciar la aplicacion de ChessX.</p>

</div>
</div>

</body>

</html>
